tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/verticalChannel/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  PatchInjection;

DragModel       SphereDrag;

DispersionModel StochasticDispersionRAS;

PatchInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

CompositionModel SingleMixtureFraction;

PhaseChangeModel LiquidEvaporation;

DevolatilisationModel none;

SurfaceReactionModel none;

PostProcessingModel PatchPostProcessing;

radiation       off;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    1;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 350;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4100;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Tvap            Tvap [ 0 0 0 1 0 ] 273;
    Tbp             Tbp [ 0 0 0 1 0 ] 373;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    LDevol          LDevol [ 0 0 0 0 0 ] 0;
    hRetentionCoeff hRetentionCoeff [ 0 0 0 0 0 ] 1;
    constantVolume  false;
}

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    Cvm             0.5;
    pressureGradient off;
    gradU           gradU;
}

PatchInjectionCoeffs
{
    SOI             0.01;
    massTotal       massTotal [ 1 0 0 0 0 ] 8;
    parcelBasisType mass;
    patchName       inletCentral;
    duration        10000;
    parcelsPerSecond 1e5;
    U0              (40 0 0);
    volumeFlowRate  constant 1;
    parcelPDF
    {
        pdfType         general;
        generalPDF
        {
            distribution
            (
                (10e-06      0.0025)
                (15e-06      0.0528)
                (20e-06      0.2795)
                (25e-06      1.0918)
                (30e-06      2.3988)
                (35e-06      4.4227)
                (40e-06      6.3888)
                (45e-06      8.6721)
                (50e-06      10.3153)
                (55e-06      11.6259)
                (60e-06      12.0030)
                (65e-06      10.4175)
                (70e-06      10.8427)
                (75e-06      8.0016)
                (80e-06      6.1333)
                (85e-06      3.8827)
                (90e-06      3.4688)
            );
        }
    }
}

StandardWallInteractionCoeffs
{
    type            rebound;
}

RanzMarshallCoeffs
{
    BirdCorrection  off;
}

SingleMixtureFractionCoeffs
{
    phases
    (
        gas
        {
        }
        liquid
        {
            H2O 1;
        }
        solid
        {
        }
    );
    YGasTot0        0;
    YLiquidTot0     1;
    YSolidTot0      0;
}

LiquidEvaporationCoeffs
{
    enthalpyTransfer enthalpyDifference;

    activeLiquids
    (
        H2O
    );
}

PatchPostProcessingCoeffs
{
    maxStoredParcels 100;

    patches
    (
        outlet
    );
}


// ************************************************************************* //
